//
//  ConstantLinksAndShares.swift
//  Compound
//
//  Created by robert on 12/12/2018.
//  Copyright © 2018 Robert Zakiev. All rights reserved.
//

import Foundation

struct SmartLablinks {
    static let allLinks: [(stock: String, link: String)] = [
        ("Московская Биржа", "https://smart-lab.ru/forum/MOEX"),
        ("АФК Система", "https://smart-lab.ru/forum/afk-sistema"),
        ("Лукойл", "https://smart-lab.ru/forum/LKOH"),
        ("МТС", "https://smart-lab.ru/forum/%D0%9C%D0%A2%D0%A1"),
        ("Детский Мир","https://smart-lab.ru/forum/det-mir"),
        ("Распадская", "https://smart-lab.ru/forum/RASP"),
        ("Сбербанк", "https://smart-lab.ru/forum/SBER"),
        ("Газпром", "https://smart-lab.ru/forum/GAZP"),
        ("Новатэк", "https://smart-lab.ru/forum/NVTK"),
        ("Яндекс", "https://smart-lab.ru/forum/YNDX"),
        ("ФСК ЕЭС", "https://smart-lab.ru/forum/FEES"),
        ("Роснефть", "https://smart-lab.ru/forum/ROSN"),
        ("Норильский Никель", "https://smart-lab.ru/forum/%D0%93%D0%9C%D0%9A%20%D0%9D%D0%BE%D1%80%D0%BD%D0%B8%D0%BA%D0%B5%D0%BB%D1%8C"),
        ("Русал", "https://smart-lab.ru/forum/RUAL"),
        ("Группа ЛСР", "https://smart-lab.ru/forum/%D0%9B%D0%A1%D0%A0%20%D0%93%D1%80%D1%83%D0%BF%D0%BF%D0%B0"),
        ("Газпромнефть", "https://smart-lab.ru/forum/%D0%93%D0%B0%D0%B7%D0%BF%D1%80%D0%BE%D0%BC%D0%BD%D0%B5%D1%84%D1%82%D1%8C"),
        ("НЛМК", "https://smart-lab.ru/forum/%D0%9D%D0%9B%D0%9C%D0%9A"),
        ("Полюс Золото", "https://smart-lab.ru/forum/PLZL"),
        ("Русгидро", "https://smart-lab.ru/forum/HYDR")
    ]
}

struct ConstantsSharesIssued {
    static let sharesIssued: [(company: String, shares: Int)] = [
        ("АФК Система" , 9_650_000_000),
        ("Сбербанк" , 22_586_948_000),
        ("Московская Биржа" , 2_276_401_458),
        ("Лукойл" , 750_000_000),
        ("МТС", 1_998_000_000),
        ("Детский Мир", 739_000_000),
        ("Распадская", 703_000_000),
        ("Газпром", 23_673_000_000),
        ("Новатэк", 3_036_000_000),
        ("Яндекс", 330_000_000),
        ("ФСК ЕЭС", 1_274_665_000_000),
        ("Роснефть", 10_598_000_000),
        ("Норильский Никель", 158_000_000),
        ("Русал", 15_193_000_000),
        ("Группа ЛСР", 103_000_000),
        ("Газпромнефть", 4_741_000_000),
        ("НЛМК", 5_993_000_000),
        ("Полюс Золото", 134_000_000),
        ("Русгидро", 426_288_000_000)
    ]
}

struct ConstantDividend {
    static let dividendPolicyList: [String : String] = [
        "АФК Система" : "Не менее 6% от стоимости акций, но не менее 1.19 р. на акцию.",
        "Детский Мир" : "Не менее 50% от чистой прибыли.",
        "МТС" : "Не менее 20 руб. на акцию.",
        "Сбербанк" : "Стремятся к выплате 50% от чистой прибыли по МСФО.",
        "Московская Биржа" : "Не менее 55% чистой прибыли по МСФО.",
        "Газпром" : "От 17,5% до 35% чистой прибыли.",
        ]
    
}

struct ConstantIndustries {
    static let stockIndustries: [String : [String]] = [
        "ТЕЛЕКОМЫ" : ["МТС"],
        "ФИНАНСЫ" : ["Сбербанк", "Московская Биржа"],
        "МЕДИЦИНА" : ["Биннофарм", "Медси"],
        "НЕФТЕГАЗ" : ["Газпром", "Новатэк", "Роснефть", "Лукойл", "Газпромнефть"],
        "ГОСТИНИЦЫ" : ["Сosmos Group"],
        "РИТЕЙЛ" : ["Детский Мир"],
        "ДЕРЕВООБРАБОТКА" : ["Сегежа"],
        "НЕДВИЖИМОСТЬ" : ["АФК: Недвижимость", "Группа ЛСР"],
        "СЕЛЬСКОЕ ХОЗЯЙСТВО" : ["Степь"],
        "ЭЛЕКТРОЭНЕРГЕТИКА" : ["БЭСК", "ФСК ЕЭС", "Русгидро"],
        "IT" : ["Яндекс", "РТИ"],
        "МЕТАЛЛЫ" : ["Норильский Никель", "Русал", "НЛМК", "Полюс Золото"],
        "УГОЛЬ" : ["Распадская"]
    ]
}

struct ConstantsSustainability {
    static let businessSustainability: [(company: String, sustainability: String)] = [
        ("АФК Система" , "Средняя"),
        ("Сбербанк" , "Высокая"),
        ("Московская Биржа" , "Высокая"),
        ("Лукойл" , "Высокая"),
        ("МТС", "Средняя"),
        ("Детский Мир", "Средняя"),
        ("Распадская", "Низкая"),
        ("Газпром", "Высокая"),
        ("Новатэк", "Высокая"),
        ("Яндекс", "Высокая"),
        ("ФСК ЕЭС", "Высокая"),
        ("Роснефть", "Высокая"),
        ("Норильский Никель", "Высокая"),
        ("Русал", "Средняя"),
        ("Группа ЛСР", "Средняя"),
        ("Газпромнефть", "Высокая"),
        ("НЛМК", "Средняя"),
        ("Полюс Золото", "Высокая"),
        ("Русгидро", "Высокая")
    ]
}

struct BrokerFees {
    static let fees: [(broker: String, fees: [Double])] = [
    ("Сбербанк", [0.165, 0.125, 0.075, 0.045, 0.035, 0.03, 0.012, 0.006]),
    ("ВТБ", [0.0413, 0.0472, 0.0295, 0.02596, 0.02124, 0.0195, 0.015]),
    ("Финам", [0.0354, 0.0295, 0.0236, 0.0177, 0.01534, 0.0118, 0.00944]),
    ("Открытие", [0.057, 0.045, 0.025])
    ]

}
